lib/tasks/active_record.rake

  task posts: :environment do
    moderators = User.where(moderator: true)
    Post.where(user: moderators).each do |post|
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" IN (SELECT "users"."id" FROM "users" WHERE "users"."moderator" = $1)  [["moderator", true]]